json-server/jmeter/reports/statistics.json
{
  "POST /payments" : {
    "transaction" : "POST /payments",
    "sampleCount" : 5,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 6.8,
    "medianResTime" : 6.0,
    "minResTime" : 2.0,
    "maxResTime" : 14.0,
    "pct1ResTime" : 14.0,
    "pct2ResTime" : 14.0,
    "pct3ResTime" : 14.0,
    "throughput" : 6.468305304010349,
    "receivedKBytesPerSec" : 3.5537778945666236,
    "sentKBytesPerSec" : 1.6322364165588614
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 5,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 6.8,
    "medianResTime" : 6.0,
    "minResTime" : 2.0,
    "maxResTime" : 14.0,
    "pct1ResTime" : 14.0,
    "pct2ResTime" : 14.0,
    "pct3ResTime" : 14.0,
    "throughput" : 6.468305304010349,
    "receivedKBytesPerSec" : 3.5537778945666236,
    "sentKBytesPerSec" : 1.6322364165588614
  }
}